In [67]:
import pandas as pd

In [68]:
# Cr√©ation du dataframe states

In [72]:
df = pd.read_csv('us-states.csv')
df.head()

         date       state  fips  cases  deaths
0  2020-01-21  Washington    53      1       0
1  2020-01-22  Washington    53      1       0
2  2020-01-23  Washington    53      1       0
3  2020-01-24    Illinois    17      1       0
4  2020-01-24  Washington    53      1       0

In [73]:
df_states = df.drop(['date','deaths','cases'], axis =1)
df_states.head()

        state  fips
0  Washington    53
1  Washington    53
2  Washington    53
3    Illinois    17
4  Washington    53

In [74]:
df_states = df_states.drop_duplicates()

In [75]:
df_states.describe()

            fips
count  56.000000
mean   32.535714
std    19.075891
min     1.000000
25%    17.750000
50%    31.500000
75%    46.250000
max    78.000000

In [76]:
df_states.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 56 entries, 0 to 31256
Data columns (total 2 columns):
state    56 non-null object
fips     56 non-null int64
dtypes: int64(1), object(1)
memory usage: 1.3+ KB

In [77]:
df_states = df_states.sort_values(by = 'state', ascending = True)
df_states = df_states.rename(columns={"state": "name"})
df_states.head()

                 name  fips
586           Alabama     1
539            Alaska     2
31256  American Samoa    60
8             Arizona     4
495          Arkansas     5

In [78]:
df_states = df_states.reset_index()
df_states = df_states.drop('index', axis=1)
df_states = df_states.reset_index()
df_states = df_states.rename(columns={"index": "id"})
df_states.head()

   id            name  fips
0   0         Alabama     1
1   1          Alaska     2
2   2  American Samoa    60
3   3         Arizona     4
4   4        Arkansas     5

In [80]:
df_states.to_csv('states_clean.csv', index=False)